# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...

# TODO здесь ваш код

from lesson_005 import room_1, room_2
print("В команте room_1 живут", room_1.folks, "а также в room_2", room_2.folks)
