# -*- coding: utf-8 -*-
from pprint import pprint
import zipfile
from random import randint

# Подсчитать статистику по буквам в романе Война и Мир.
# Входные параметры: файл для сканирования
# Статистику считать только для букв алфавита (см функцию .isalpha() для строк)
#
# Вывести на консоль упорядоченную статистику в виде
# +---------+----------+
# |  буква  | частота  |
# +---------+----------+
# |    А    |   77777  |
# |    Б    |   55555  |
# |   ...   |   .....  |
# |    a    |   33333  |
# |    б    |   11111  |
# |   ...   |   .....  |
# +---------+----------+
# |  итого  | 9999999  |
# +---------+----------+
#
# Упорядочивание по частоте - по убыванию. Ширину таблицы подберите по своему вкусу
# Требования к коду: он должен быть готовым к расширению функциональности. Делать сразу на классах.

# TODO здесь ваш код

zip_file_name = 'C:\\Users\\Anton\\PycharmProjects\\untitled\\lesson_009\\python_snippets\\voyna-i-mir.txt.zip'

zfile = zipfile.ZipFile(zip_file_name, 'r')
for filename in zfile.namelist():
    zfile.extract(filename)


file_name = 'voyna-i-mir.txt'
file_name_letters = file_name.isalpha()

sequence = ''
stat = {}
with open(file_name, 'r', encoding='cp1251') as file:
    for line in file:
        # print(line)
        for char in line:
            if sequence in stat:
                if char in stat[sequence]:
                    stat[sequence][char] += 1
                else:
                    stat[sequence][char] = 1
            else:
                stat[sequence] = {char: 1}
            sequence = sequence[1:] + char

pprint(stat)

# После выполнения первого этапа нужно сделать упорядочивание статистики
#  - по частоте по возрастанию
#  - по алфавиту по возрастанию
#  - по алфавиту по убыванию
# Для этого пригодится шаблон проектирование "Шаблонный метод" см https://goo.gl/Vz4828
